content-org/all-posts.org
#+hugo_base_dir: ../
* DONE Link Roundup: June 10, 2024
CLOSED: [2024-06-10]
:PROPERTIES:
:ID:       76D2671A-2446-486F-8D13-470F80EF1E84
:EXPORT_FILE_NAME: link-roundup-june-10-2024
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :summary "A link roundup on AI development."
:END:

Here are a few links I found interesting this week. Following a
technique I noticed on
[[https://idratherbewriting.com/blog/links-around-web-june-10-2024][Tom
Johnson's blog]] (as well as the theme of the articles), I use AI tools
to help provide summaries and then offer some thoughts of my own.

** Apple, "Introducing Apple Intelligence, the personal intelligence
:PROPERTIES:
:ID:       995C9908-A6AE-402C-8940-69749A275F5F
:END:
system that puts powerful generative models at the core of iPhone, iPad,
and Mac"
   :PROPERTIES:
   :CUSTOM_ID: apple-introducing-apple-intelligence-the-personal-intelligence-system-that-puts-powerful-generative-models-at-the-core-of-iphone-ipad-and-mac
   :END:
[[https://www.apple.com/newsroom/2024/06/introducing-apple-intelligence-for-iphone-ipad-and-mac/][Link
to Article]]

*** Summary
    :PROPERTIES:
    :CUSTOM_ID: summary
    :ID:       E23D093C-BA7E-4071-929C-D9B8D8B9CFAA
    :END:
Apple is introducing a new personal intelligence system called Apple
Intelligence that will be integrated across iPhone, iPad, and Mac
devices. Some key features of Apple Intelligence include:

- New systemwide Writing Tools.
- Improved photo and video search capabilities.
- Integration of ChatGPT across Apple platforms.
- New email features like Priority Messages and smart summaries in the
  Mail app.
- Improved Siri capabilities.
- A new "Image Playground" feature.
- A focus on privacy.

*** My Thoughts
    :PROPERTIES:
    :CUSTOM_ID: my-thoughts
    :ID:       55A26C70-FE06-48B2-965A-918233881E68
    :END:
It will be *extraordinarily interesting* to see how this reshapes
conversations about AI. Personally, I'm really interested in how this
ease of access will alter conversations about these new tools in higher
education. I've already begun to adapt to these tools and integrate them
into my workflows (for quite a while now, actually), as have many folks
working in various writing professions, such as technical communication.
In my view, though, many academics in writing-related fields haven't
seriously engaged them. I'm looking forward to seeing how this continues
to develop in the Fall.

** OpenAI, "OpenAI and Apple announce partnership to integrate ChatGPT
:PROPERTIES:
:ID:       9E86C8C6-4C7C-4DA4-9310-5313EA23FB65
:END:
into Apple experiences"
   :PROPERTIES:
   :CUSTOM_ID: openai-openai-and-apple-announce-partnership-to-integrate-chatgpt-into-apple-experiences
   :END:
[[https://openai.com/index/openai-and-apple-announce-partnership/][Link
to Article]]

*** Summary
    :PROPERTIES:
    :CUSTOM_ID: summary-1
    :ID:       B917582C-D344-4560-8036-7F8450FA4876
    :END:
Apple announced at the Worldwide Developer Conference 2024 that they're
integrating ChatGPT into iOS, iPadOS, and macOS, enabling seamless
access to its capabilities like image and document understanding without
switching between apps. The integration, powered by GPT-4o, will roll
out later in the year, offering free access and optional premium
features for ChatGPT subscribers.

*** My Thoughts
    :PROPERTIES:
    :CUSTOM_ID: my-thoughts-1
    :ID:       B21E3495-B7E2-4D3A-B324-4458BA828BAE
    :END:
Similar to my comments above, I'm just struck by how accessible AI tools
are about to be for *everyone*, and how inextricable they will be from
other types of work. The line between work done with AI tools and work
done without AI tools will soon become meaningless, I think. Anyone in
knowledge work will need to embrace them and be conscious of both their
value and limitations. Ignoring them, though, is not a possibility.

