content/posts/link-roundup-june-10-2024.md
+++
title = "Link Roundup: June 10, 2024"
author = ["Rick Wysocki"]
date = 2024-06-10T00:00:00-04:00
draft = false
summary = "Here is my post summary."
+++

Here are a few links I found interesting this week. Following a
technique I noticed on
[Tom
Johnson's blog](https://idratherbewriting.com/blog/links-around-web-june-10-2024) (as well as the theme of the articles), I use AI tools
to help provide summaries and then offer some thoughts of my own.


## Apple, "Introducing Apple Intelligence, the personal intelligence {#apple-introducing-apple-intelligence-the-personal-intelligence}

system that puts powerful generative models at the core of iPhone, iPad,
and Mac"

:CUSTOM_ID: apple-introducing-apple-intelligence-the-personal-intelligence-system-that-puts-powerful-generative-models-at-the-core-of-iphone-ipad-and-mac

[Link
to Article](https://www.apple.com/newsroom/2024/06/introducing-apple-intelligence-for-iphone-ipad-and-mac/)


### Summary {#summary}

Apple is introducing a new personal intelligence system called Apple
Intelligence that will be integrated across iPhone, iPad, and Mac
devices. Some key features of Apple Intelligence include:

-   New systemwide Writing Tools.
-   Improved photo and video search capabilities.
-   Integration of ChatGPT across Apple platforms.
-   New email features like Priority Messages and smart summaries in the
    Mail app.
-   Improved Siri capabilities.
-   A new "Image Playground" feature.
-   A focus on privacy.


### My Thoughts {#my-thoughts}

It will be **extraordinarily interesting** to see how this reshapes
conversations about AI. Personally, I'm really interested in how this
ease of access will alter conversations about these new tools in higher
education. I've already begun to adapt to these tools and integrate them
into my workflows (for quite a while now, actually), as have many folks
working in various writing professions, such as technical communication.
In my view, though, many academics in writing-related fields haven't
seriously engaged them. I'm looking forward to seeing how this continues
to develop in the Fall.


## OpenAI, "OpenAI and Apple announce partnership to integrate ChatGPT {#openai-openai-and-apple-announce-partnership-to-integrate-chatgpt}

into Apple experiences"

:CUSTOM_ID: openai-openai-and-apple-announce-partnership-to-integrate-chatgpt-into-apple-experiences

[Link
to Article](https://openai.com/index/openai-and-apple-announce-partnership/)


### Summary {#summary-1}

Apple announced at the Worldwide Developer Conference 2024 that they're
integrating ChatGPT into iOS, iPadOS, and macOS, enabling seamless
access to its capabilities like image and document understanding without
switching between apps. The integration, powered by GPT-4o, will roll
out later in the year, offering free access and optional premium
features for ChatGPT subscribers.


### My Thoughts {#my-thoughts-1}

Similar to my comments above, I'm just struck by how accessible AI tools
are about to be for **everyone**, and how inextricable they will be from
other types of work. The line between work done with AI tools and work
done without AI tools will soon become meaningless, I think. Anyone in
knowledge work will need to embrace them and be conscious of both their
value and limitations. Ignoring them, though, is not a possibility.
